"""

    Напишите функцию exponentiation, которая принимает на вход целое число и выводит на экран через пробел квадрат и куб этого числа. 

"""

def exponentiation(n):
    print(n**2, n**3)
    
exponentiation(int(input('Введите число для рассчетов ')))    




