"""

    Создать функцию с именем keanu_reeves, которая выводит сообщение

YOU'RE BREATHTAKING

"""

def keanu_reeves():
    print("YOU'RE BREATHTAKING")

keanu_reeves()
          
