"""

    Найти ключ, связанный с максимальным значением, и вывести этот ключ на экран.

"""

# letters = {"a": 10, "b": 20, "c": 25, "d": 15}
# letters = {"a": 102, "b": 101, "c": 99}

letters = {"a": -10, "b": -20, "c": -5, "d": -15, "e": -1}


print(max(letters, key=letters.get))
