"""

    закодировать строку азбукой морзе

    Выведите каждое слово исходного текста, закодированное азбукой Морзе, 
    на отдельной строке. Количество строк в ответе должно совпадать с количеством слов в исходном тексте. 
    Между закодированными буквами нужно ставить ровно один пробел. Например, слово «Help» превратится в «.... . .-.. .--.». 
    Обратите внимание, что строчные и заглавные буквы кодируются одинаково.

"""



morze = {'a': '•—', 'b': '—•••', 'c': '—•—•', 'd': '—••',
         'e': '•', 'f': '••—•', 'g': '——•', 'h': '••••',
         'i': '••', 'j': '•———', 'k': '—•—', 'l': '•—••',
         'm': '——', 'n': '—•', 'o': '———', 'p': '•——•',
         'q': '——•—', 'r': '•—•', 's': '•••', 't': '—',
         'u': '••—', 'v': '•••—', 'w': '•——', 'x': '—••—',
         'y': '—•——', 'z': '——••'}

s = ('Houston we have a problem'.lower().split())

for w in s:
    for c in w:
        print(morze[c], end = ' ')
    print()


# labels.csv
# label_id,x,y,z,X,Y,Z
# 0,0.0,8.4,0,0,0,0
# 1,0.0,7.2,0,0,0,0
# 2,0.0,6.0,0,0,0,0
# 3,0.0,4.8,0,0,0,0
# 4,0.0,3.6,0,0,0,0
# 10,1.2,8.4,0,0,0,0
# 11,1.2,7.2,0,0,0,0
# 12,1.2,6.0,0,0,0,0
# 13,1.2,4.8,0,0,0,0
# 14,1.2,3.6,0,0,0,0

# locations.csv
# label_id, location_type, load_orientation, load_long_side_length, load_short_side_length, load_long_side_length_between_legs, load_short_side_length_between_legs
# 0,UNKNOWN



