"""

    Напишите код для преобразования списка целых чисел произвольной длины в словарь, вложенность которого зависит от длины списка.
    [100, 55, 77, 55, 89] -> {100: {55: {77: {55: 89}}}}

"""

li = []
s = list(map(int, '45 45 66 21 94 62 50 13 96'.split()))
rez_di = {s[-2]:s[-1]}


for c in s[-3::-1]:
    rez_di = {c: rez_di}

print(rez_di)    